In [1]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np

import pylab as plt
import seaborn as sns

%matplotlib inline

In [2]:
df=pd.read_csv('../data/salaries_data.csv')

df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [12]:
df.work_year.value_counts()

2022    263
2021    181
2020     56
Name: work_year, dtype: int64

In [13]:
df.shape

(500, 11)

In [15]:
df.describe()

         work_year        salary  salary_in_usd  remote_ratio
count   500.000000  5.000000e+02     500.000000    500.000000
mean   2021.414000  3.342164e+05  112996.216000     71.800000
std       0.683768  1.626526e+06   69613.750601     40.472658
min    2020.000000  4.000000e+03    2859.000000      0.000000
25%    2021.000000  7.000000e+04   64594.500000     50.000000
50%    2022.000000  1.140000e+05  103080.000000    100.000000
75%    2022.000000  1.600800e+05  150000.000000    100.000000
max    2022.000000  3.040000e+07  450000.000000    100.000000

In [ ]:
codigo